Autodesk.Revit.DB.Analysis.BuildingOperatingYearSchedule.SetScheduleForDay(System.DateTime,Autodesk.Revit.DB.Analysis.BuildingOperatingDaySchedule)
Sets the BuildingOperatingDaySchedule for this day of the year.
Remarks:
The day argument must be in 2023 to match the template year in the user interface calendar: it has 365 days and starts on a Sunday.
day:
The day of the year. The value must be in 2023 (the template year) and have the time zone set to gmt/utc.
Time values will be ignored.
daySchedule:
The schedule used on that day.
Throws Autodesk.Revit.Exceptions.ArgumentException:
daySchedule must be in the same document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
day must be in the year 2023.
Since:
2025

Autodesk.Revit.DB.Analysis.BuildingOperatingYearSchedule.GetScheduleForDay(System.DateTime)
Gets the BuildingOperatingDaySchedule for this day of the year.
Remarks:
The day argument must be in 2023 to match the template year in the user interface calendar: it has 365 days and starts on a Sunday.
day:
The day of the year. The value must be in 2023 (the template year) and have the time zone set to gmt/utc.
Time values will be ignored.
Returns:
The schedule used on that day.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
day must be in the year 2023.
Since:
2025

Autodesk.Revit.DB.Analysis.BuildingOperatingYearSchedule.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Analysis.BuildingOperatingDaySchedule,System.String)
Creates a valid BuildingOperatingYearSchedule with the given name, where every day has the schedule daySchedule.
document:
The document to create this BuildingOperatingYearSchedule for.
daySchedule:
A schedule to assign to every day.
name:
The intended schedule name, may be modified to disambiguate with existing elements.
Returns:
The newly created BuildingOperatingYearSchedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element daySchedule was not found in the given document.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
name must be trimmed.
-or-
name is an empty string or contains only whitespace.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025